---
type: SplitButtonData
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# SplitButtonData

`Autodesk.Revit.UI.SplitButtonData` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SplitButtonData | 2011 | `public SplitButtonData ( string name , string text )` |